avrxml/asf/thirdparty/wireless/avr2025_mac/apps/mac/no_beacon/coord/main.c
/**
 * @file main.c
 *
 * @brief MAC Example Nobeacon Application - Coordinator
 *
 * Copyright (c) 2013-2015 Atmel Corporation. All rights reserved.
 *
 * \asf_license_start
 *
 * \page License
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice,
 *    this list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form must reproduce the above copyright notice,
 *    this list of conditions and the following disclaimer in the documentation
 *    and/or other materials provided with the distribution.
 *
 * 3. The name of Atmel may not be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * 4. This software may only be redistributed and used in connection with an
 *    Atmel microcontroller product.
 *
 * THIS SOFTWARE IS PROVIDED BY ATMEL "AS IS" AND ANY EXPRESS OR IMPLIED
 * WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF
 * MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT ARE
 * EXPRESSLY AND SPECIFICALLY DISCLAIMED. IN NO EVENT SHALL ATMEL BE LIABLE FOR
 * ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
 * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
 * OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
 * STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 * \asf_license_stop
 */

/**
 * \mainpage
 * \section preface Preface
 * This is the reference manual for the IEEE 802.15.4 MAC No-Beacon Application
 *- Coordinator
 * \section main_files Application Files
 *      - main.c                 Application main file.
 * \section intro Application Introduction
 * The basic MAC Example Nobeacon Application deploys a nonbeacon-enabled
 * network.
 * The coordinator starts a PAN at channel DEFAULT_CHANNEL with the PAN ID
 * DEFAULT_PAN_ID.
 * The device scans for this network and associates to the coordinator.
 * Once the device is associated, it uses a timer that fires every 5 seconds to
 * poll for pending data at the coordinator by means of transmitting a data
 * request frame to the coordinator.
 * On the other hand every 5 seconds the coordinator queues a dummy data frame
 * for each associated device into its indirect frame queue.
 * If the coordinator receives a data request frame from a particular device, it
 * transmits the pending data frame to the device.
 * Device after receiving the data from the Coordinator sends back the same data
 * to the Coordinator itself by direct data transmission
 * The results of the proper data transmission/reception are printed to a
 * terminal program via Serial I/O (UART or USB).
 * \note For Two Processor Approach the Application needs to be flashed in the
 * Host board(eg.SAM4L-Xplained Pro) and the Serial-if application(NoBeacon FFD)
 *(MAC Stack)
 * needs to be flashed in the NCP(Network CoProcessor) board.
 *
 * For demonstration purposes the coordinator's configuration is limited to
 * associate six devices at maximum .
 * \section api_modules Application Dependent Modules
 * - \subpage api
 * \section compinfo Compilation Info
 * This software was written for the GNU GCC and IAR .
 * Other compilers may or may not work.
 *
 * \section references References
 * 1)  IEEE Std 802.15.4-2006 Part 15.4: Wireless Medium Access Control (MAC)
 *     and Physical Layer (PHY) Specifications for Low-Rate Wireless Personal
 * Area
 *     Networks (WPANs).\n\n
 * 2)  <a href="http://www.atmel.com/design-support/">Atmel Design
 * Support</a>.\n
 *
 * \section contactinfo Contact Information
 * For further information,visit
 * <A href="http://www.atmel.com/avr">www.atmel.com</A>.\n
 */

/* === INCLUDES ============================================================ */
#include <string.h>
#include <inttypes.h>
#include <stdio.h>
#include "conf_board.h"
#include "avr2025_mac.h"
#include "delay.h"
#include "common_sw_timer.h"
#include "sio2host.h"
#include <asf.h>
#include "beacon_app.h"

/* === MACROS ============================================================== */

#define CHANNEL_OFFSET                  (2)

#ifdef BEACON_SUPPORT
/** Defines the default Beacon Order. */
#define DEFAULT_BO                      (5)
/** Defines the default Super frame Order. */
#define DEFAULT_SO                      (4)
#else
/** Defines Beacon Order for Nobeacon Network. */
#define DEFAULT_BO                     (15)
/** Defines Superframe Order for Nobeacon Network. */
#define DEFAULT_SO                     (15)
#endif /* BEACON SUPPORT */

/** Coord Realignment is not used by default in this application. */
#define DEFAULT_COORDREALIGNMENT                (false)

/** Defines the default Coord Realign SecurityLevel */
#define DEFAULT_COORDREALIGN_SEC_LVL    (0x00)

/** Defines the default Coord Realign KeyIdMode */
#define DEFAULT_COORDREALIGN_KEYID_MODE (0x00)

/** Defines the default Coord Realign KeySource */
#define DEFAULT_COORDREALIGN_KEY_SRC    (NULL)

/** Defines the default Coord Realign KeyIndex */
#define DEFAULT_COORDREALIGN_KEY_INDEX  (0x00)

/** Defines the default Beacon Security Level */
#define DEFAULT_BEACON_SEC_LVL                  (0x05)

/** Defines the default Beacon KeyIdMode */
#define DEFAULT_BEACON_KEYID_MODE               (0x01)

/** Defines the default Beacon KeySource */
#define DEFAULT_BEACON_KEY_SRC                  (default_key_source)

/** Defines the default Beacon KeyIndex */
#define DEFAULT_BEACON_KEY_INDEX                (0x00)

/**
 * Defines the time in ms to initiate an update of the beacon payload.
 */
#define APP_BCN_PAYLOAD_DURATION_MS     (3000)

/**
 * Defines the time in ms to initiate a broadcast data transmission
 * to all devices.
 */
#define APP_BC_DATA_DURATION_MS         (9000)

