avrxml/asf/thirdparty/wireless/avr2025_mac/apps/mac/no_beacon/coord/main.c
/** Defines the time to initiate a indirect data transmission to the device. */
#define APP_INDIRECT_DATA_DURATION_MS   (6000)
#ifdef GTS_SUPPORT
/** Defines the time to initiate a GTS data transmission to the device. */
#define APP_GTS_DATA_DURATION_MS        (2000)
#endif
#define DEBOUNCE_DELAY_MS               (200)

#if (LED_COUNT >= 3)
#define LED_START                       (LED0)
#define LED_NWK_SETUP                   (LED1)
#define LED_DATA                        (LED2)
#elif (LED_COUNT == 2)
#define LED_START                       (LED0)
#define LED_NWK_SETUP                   (LED0)
#define LED_DATA                        (LED1)
#else
#define LED_START                       (LED0)
#define LED_NWK_SETUP                   (LED0)
#define LED_DATA                        (LED0)
#endif

/* === GLOBALS ============================================================= */
extern uint8_t default_key_source[8];
/** This array stores all device related information. */
associated_device_t device_list[MAX_NUMBER_OF_DEVICES];
/** Stores the number of associated devices. */
uint16_t no_of_assoc_devices;

/** This array stores the current beacon payload. */
uint8_t beacon_payload[] = {"Atmel beacon demo 0"};
uint8_t broadcast_payload[] = {"Broadcast Data"};
#ifdef GTS_SUPPORT
static uint8_t gts_payload[] = {"GTS Data from coordinator"};
#endif /* GTS_SUPPORT */
/** This variable stores the current state of the node. */
coord_state_t coord_state = COORD_STARTING;
/** This variable counts the number of transmitted data frames. */
static uint32_t tx_cnt;
/** Store the current MSDU handle to be used for a data frame. */
static uint8_t curr_msdu_handle;
#ifdef GTS_SUPPORT
static uint8_t gts_msdu_handle;
#endif /* GTS_SUPPORT */
uint8_t current_channel;
uint8_t current_channel_page;
static uint32_t channels_supported;
#ifdef GTS_SUPPORT
static uint8_t APP_TIMER_GTS_DATA;
#endif /* GTS_SUPPORT */
static uint8_t APP_TIMER_INDIRECT_DATA;
static uint8_t APP_TIMER_BCN_PAYLOAD_UPDATE;
static uint8_t APP_TIMER_BC_DATA;
#ifdef GPIO_PUSH_BUTTON_0
static wpan_addr_spec_t dst_addr;
#endif /* GPIO_PUSH_BUTTON_0 */

#ifdef MAC_SECURITY_ZIP
/** Store the recently associated device number */
uint16_t recent_assoc_dev_no = 0xFFFF;
#endif

/* === PROTOTYPES ========================================================== */

/**
 * @brief Application specific function to assign a short address
 */
static bool assign_new_short_addr(uint64_t addr64, uint16_t *addr16);

/**
 * @brief Callback function for initiation of broadcast data transmission
 *
 * @param parameter Pointer to callback parameter
 *                  (not used in this application, but could be used
 *                  to indicated LED to be switched off)
 */
static void bc_data_cb(void *parameter);

/**
 * @brief Callback function for initiation of indirect data transmission
 *
 * @param parameter Pointer to callback parameter
 *                  (not used in this application, but could be used
 *                  to indicated LED to be switched off)
 */
static void indirect_data_cb(void *parameter);

#ifdef GTS_SUPPORT

/**
 * @brief Callback function for initiation of gts data transmission
 *
 * @param parameter Pointer to callback parameter
 *                  (not used in this application, but could be used
 *                  to indicated LED to be switched off)
 */
static void gts_data_cb(void *parameter);

#endif

/**
 * @brief Callback function for updating the beacon payload
 *
 * @param parameter Pointer to callback parameter
 *                  (not used in this application, but could be used
 *                  to indicated LED to be switched off)
 */
static void bcn_payload_update_cb(void *parameter);

/** Alert to indicate something has gone wrong in the application */
static void app_alert(void);

/** This function shows the stack and application
 *  capabilities on terminal if SIO_HUB switch
 *  is enabled.
 */
static void print_stack_app_build_features(void);

/* === IMPLEMENTATION ====================================================== */

/**
 * @brief Main function of the coordinator application
 *
 * This function initializes the MAC, initiates a MLME reset request
 * (@ref wpan_mlme_reset_req()), and implements a the main loop.
 */
int main(void)
{
	irq_initialize_vectors();
	#if SAMD || SAMR21
	system_init();
	delay_init();
	#else
	sysclk_init();

	/* Initialize the board.
	 * The board-specific conf_board.h file contains the configuration of
	 * the board initialization.
	 */
	board_init();
	#endif
	#ifdef SIO_HUB
	sio2host_init();
	#endif
	sw_timer_init();

	if (MAC_SUCCESS != wpan_init()) {
		app_alert();
	}

	/* Initialize LEDs. */
	LED_On(LED_START);     /* indicating application is started */
	LED_Off(LED_NWK_SETUP); /* indicating network is started */
	LED_Off(LED_DATA);     /* indicating data transmission */

	cpu_irq_enable();

#ifdef SIO_HUB

	/* Initialize the serial interface used for communication with terminal
	 * program. */

	/* To make sure the Hyper Terminal Connected to the system*/
	sio2host_getchar();

#ifdef BEACON_SUPPORT
	printf("\nBeacon_Application\r\n\n");
#else
	printf("\nNO Beacon_Application\r\n\n");
#endif
	printf("\nCoordinator\r\n\n");
	print_stack_app_build_features();
#endif /* SIO_HUB */

	sw_timer_get_id(&APP_TIMER_INDIRECT_DATA);
	sw_timer_get_id(&APP_TIMER_BCN_PAYLOAD_UPDATE);
	sw_timer_get_id(&APP_TIMER_BC_DATA);
	#ifdef GTS_SUPPORT
	sw_timer_get_id(&APP_TIMER_GTS_DATA);
    #endif

	/*
	 * Reset the MAC layer to the default values.
	 * This request will cause a mlme reset confirm message ->
	 * usr_mlme_reset_conf
	 */
	wpan_mlme_reset_req(true);

#ifdef GPIO_PUSH_BUTTON_0
	dst_addr.AddrMode = 2;
	dst_addr.PANId = DEFAULT_PAN_ID;
#endif /* GPIO_PUSH_BUTTON_0 */

	while (true) {
		wpan_task();
#ifdef GPIO_PUSH_BUTTON_0
		if (!ioport_get_pin_level(GPIO_PUSH_BUTTON_0)) {
			delay_ms(DEBOUNCE_DELAY_MS);
			if (!ioport_get_pin_level(GPIO_PUSH_BUTTON_0)) {
				dst_addr.Addr.short_address = BROADCAST;
				wpan_mcps_data_req(FCF_SHORT_ADDR, &dst_addr,
						strlen((const char *)
						broadcast_payload),
						(uint8_t *)&broadcast_payload, 1,
						WPAN_TXOPT_OFF);
			}
		}
#endif /* GPIO_PUSH_BUTTON_0 */
	}
}

