avrxml/asf/thirdparty/wireless/avr2025_mac/apps/mac/no_beacon/coord/main.c
/*
 * Callback function usr_mlme_rx_enable_conf
 *
 * @param status           Result of requested receiver enable operation.
 *
 * @return void
 */
void usr_mlme_rx_enable_conf(uint8_t status)
{
}

#endif  /* (MAC_RX_ENABLE_SUPPORT == 1) */

#if ((MAC_SCAN_ED_REQUEST_CONFIRM == 1)      ||	\
	(MAC_SCAN_ACTIVE_REQUEST_CONFIRM == 1)  || \
	(MAC_SCAN_PASSIVE_REQUEST_CONFIRM == 1) || \
	(MAC_SCAN_ORPHAN_REQUEST_CONFIRM == 1))

/*
 * @brief Callback function usr_mlme_scan_conf
 *
 * @param status            Result of requested scan operation
 * @param ScanType          Type of scan performed
 * @param ChannelPage       Channel page on which the scan was performed
 * @param UnscannedChannels Bitmap of unscanned channels
 * @param ResultListSize    Number of elements in ResultList
 * @param ResultList        Pointer to array of scan results
 */
void usr_mlme_scan_conf(uint8_t status,
		uint8_t ScanType,
		uint8_t ChannelPage,
		uint32_t UnscannedChannels,
		uint8_t ResultListSize,
		void *ResultList)
{
	/*
	 * We are not interested in the actual scan result,
	 * because we start our network on the pre-defined channel anyway.
	 * Start a beacon-enabled network
	 * Use: bool wpan_mlme_start_req(uint16_t PANId,
	 *                               uint8_t LogicalChannel,
	 *                               uint8_t ChannelPage,
	 *                               uint8_t BeaconOrder,
	 *                               uint8_t SuperframeOrder,
	 *                               bool PANCoordinator,
	 *                               bool BatteryLifeExtension,
	 *                               bool CoordRealignment)
	 *
	 * This request leads to a start confirm message -> usr_mlme_start_conf
	 */
	wpan_mlme_start_req(DEFAULT_PAN_ID,
			current_channel,
			current_channel_page,
			DEFAULT_BO,
			DEFAULT_SO,
			true, false,
			DEFAULT_COORDREALIGNMENT

#ifdef MAC_SECURITY_BEACON
			, DEFAULT_COORDREALIGN_SEC_LVL,
			DEFAULT_COORDREALIGN_KEYID_MODE,
			DEFAULT_COORDREALIGN_KEY_SRC,
			DEFAULT_COORDREALIGN_KEY_INDEX,
			DEFAULT_BEACON_SEC_LVL,
			DEFAULT_BEACON_KEYID_MODE,
			DEFAULT_BEACON_KEY_SRC,
			DEFAULT_BEACON_KEY_INDEX
#endif
			);

	/* Keep compiler happy. */
	status = status;
	ScanType = ScanType;
	ChannelPage = ChannelPage;
	UnscannedChannels = UnscannedChannels;
	ResultListSize = ResultListSize;
	ResultList = ResultList;
}

#endif

#ifndef MAC_SECURITY_ZIP
void usr_mlme_set_conf(uint8_t status,
		uint8_t PIBAttribute)
{
	if ((status == MAC_SUCCESS) && (PIBAttribute == macShortAddress)) {
		/*
		 * Allow other devices to associate to this coordinator.
		 * Use: bool wpan_mlme_set_req(uint8_t PIBAttribute,
		 *                             void *PIBAttributeValue);
		 *
		 * This request leads to a set confirm message ->
		 * usr_mlme_set_conf
		 */
		uint8_t association_permit = true;

		wpan_mlme_set_req(macAssociationPermit,
				&association_permit);
	} else if ((status == MAC_SUCCESS) &&
			(PIBAttribute == macAssociationPermit)) {
		/*
		 * Set RX on when idle to enable the receiver as default.
		 * Use: bool wpan_mlme_set_req(uint8_t PIBAttribute,
		 *                             void *PIBAttributeValue);
		 *
		 * This request leads to a set confirm message ->
		 * usr_mlme_set_conf
		 */
#ifdef BEACON_SUPPORT
		bool rx_on_when_idle = false;
#else
		bool rx_on_when_idle = true;
#endif
		wpan_mlme_set_req(macRxOnWhenIdle,
				&rx_on_when_idle);
	} else if ((status == MAC_SUCCESS) &&
			(PIBAttribute == macRxOnWhenIdle)) {
		/* Set the beacon payload length. */
		uint8_t beacon_payload_len = BEACON_PAYLOAD_LEN;
		wpan_mlme_set_req(macBeaconPayloadLength,
				&beacon_payload_len);
	} else if ((status == MAC_SUCCESS) &&
			(PIBAttribute == macBeaconPayloadLength)) {
		/*
		 * Once the length of the beacon payload has been defined,
		 * set the actual beacon payload.
		 */
		wpan_mlme_set_req(macBeaconPayload,
				&beacon_payload);
	} else if ((status == MAC_SUCCESS) &&
			(PIBAttribute == macBeaconPayload)) {
		if (COORD_STARTING == coord_state) {
			/*
			 * Initiate an active scan over all channels to
			 * determine
			 * which channel to use.
			 * Use: bool wpan_mlme_scan_req(uint8_t ScanType,
			 *                              uint32_t ScanChannels,
			 *                              uint8_t ScanDuration,
			 *                              uint8_t ChannelPage);
			 *
			 * This request leads to a scan confirm message ->
			 * usr_mlme_scan_conf
			 * Scan for about 50 ms on each channel -> ScanDuration
			 *= 1
			 * Scan for about 1/2 second on each channel ->
			 * ScanDuration = 5
			 * Scan for about 1 second on each channel ->
			 * ScanDuration = 6
			 */
			wpan_mlme_scan_req(MLME_SCAN_TYPE_ACTIVE,
					SCAN_CHANNEL(current_channel),
					SCAN_DURATION_COORDINATOR,
					current_channel_page);
		} else {
			/* Do nothing once the node is properly running. */
		}
	} else {
		/* Something went wrong; restart. */
		wpan_mlme_reset_req(true);
	}
}

#endif

/*
 * @brief Callback function usr_mlme_start_conf
 *
 * @param status        Result of requested start operation
 */
#if (MAC_START_REQUEST_CONFIRM == 1)
void usr_mlme_start_conf(uint8_t status)
{
	if (status == MAC_SUCCESS) {
		coord_state = COORD_RUNNING;
#ifdef SIO_HUB
#ifdef BEACON_SUPPORT
		printf("\r\nStarted beacon-enabled network in Channel - %d\r\n",
				current_channel);
#else
		printf("\r\nStarted No beacon network in Channel - %d\r\n",
				current_channel);
#endif
#endif

		/*
		 * Network is established.
		 * Waiting for association indication from a device.
		 * -> usr_mlme_associate_ind
		 */
		LED_On(LED_NWK_SETUP);

		/*
		 * Now that the network has been started successfully,
		 * the timer for broadcast data transmission is started.
		 * This is independent from the actual number of associated
		 * nodes.
		 */

		/* Start timer to initiate broadcast data transmission. */
		sw_timer_start(APP_TIMER_BC_DATA,
				((uint32_t)APP_BC_DATA_DURATION_MS * 1000),
				SW_TIMEOUT_RELATIVE,
				(FUNC_PTR)bc_data_cb,
				NULL);

		/*
		 * Now that the network has been started successfully,
		 * the timer for updating the beacon payload is started.
		 */
		sw_timer_start(APP_TIMER_BCN_PAYLOAD_UPDATE,
				((uint32_t)APP_BCN_PAYLOAD_DURATION_MS * 1000),
				SW_TIMEOUT_RELATIVE,
				(FUNC_PTR)bcn_payload_update_cb,
				NULL);
	} else {
		/* Something went wrong; restart. */
		wpan_mlme_reset_req(true);
	}
}

